app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sports"], ["is_private", 0], ["created_at", "2024-03-01 06:43:24.728727"], ["updated_at", "2024-03-01 06:43:24.728727"]]
---
  def create
    @room = Room.create(name: params["room"]["name"])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @current_user = current_user
    @single_room = Room.find(params[:id])